var a = 1, b = 1, c, d;
c = ++a; alert(c);           // 2   В префиксной форме инкрементирование производится сразу, а возврат — уже с обновленным значением.
d = b++; alert(d);           // 1   В постфиксной форме сначала происходит возвращение значения, а потом выполняется инкрементирование.
c = (2 + ++a); alert(c);      // 5   в строке 2 а =2, здесь ++а получается 3 и далее + в итоге 5.
d = (2 + b++); alert(d);      // 4   в строке 3 b =2, здесь b++ получается присложении остается 2. и далее сложение  в итоге 4.
alert(a);                    // 3   после строки 2 а=2, а после строки 4 получается 3
alert(b);                    // 3   после строки 3 а=2, а после строки 5 получается 3